; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-0 - location
	p2-3 - location
	p2-4 - location
	p2-6 - location
	p4-7 - location
	p5-2 - location
	p5-3 - location
	p7-0 - location
	p7-5 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s5)
	(at driver3 s0)
	(at driver4 s3)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s1)
	(at package2 s3)
	(at package3 s5)
	(at package4 s4)
	(at package5 s1)
	(at package6 s6)
	(at package7 s7)
	(at package8 s5)
	(at package9 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 97)
	(= (time-to-walk p0-1 s0) 97)
	(= (time-to-walk s1 p0-1) 20)
	(= (time-to-walk p0-1 s1) 20)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 94)
	(= (time-to-walk p0-2 s0) 94)
	(= (time-to-walk s2 p0-2) 62)
	(= (time-to-walk p0-2 s2) 62)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 38)
	(= (time-to-walk p0-3 s0) 38)
	(= (time-to-walk s3 p0-3) 11)
	(= (time-to-walk p0-3 s3) 11)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 29)
	(= (time-to-walk p2-3 s2) 29)
	(= (time-to-walk s3 p2-3) 77)
	(= (time-to-walk p2-3 s3) 77)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 70)
	(= (time-to-walk p2-4 s2) 70)
	(= (time-to-walk s4 p2-4) 21)
	(= (time-to-walk p2-4 s4) 21)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 46)
	(= (time-to-walk p2-6 s2) 46)
	(= (time-to-walk s6 p2-6) 88)
	(= (time-to-walk p2-6 s6) 88)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 100)
	(= (time-to-walk p4-7 s4) 100)
	(= (time-to-walk s7 p4-7) 4)
	(= (time-to-walk p4-7 s7) 4)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 77)
	(= (time-to-walk p5-2 s5) 77)
	(= (time-to-walk s2 p5-2) 41)
	(= (time-to-walk p5-2 s2) 41)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 17)
	(= (time-to-walk p5-3 s5) 17)
	(= (time-to-walk s3 p5-3) 68)
	(= (time-to-walk p5-3 s3) 68)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 92)
	(= (time-to-walk p7-0 s7) 92)
	(= (time-to-walk s0 p7-0) 96)
	(= (time-to-walk p7-0 s0) 96)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 2)
	(= (time-to-walk p7-5 s7) 2)
	(= (time-to-walk s5 p7-5) 44)
	(= (time-to-walk p7-5 s5) 44)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 89)
	(= (time-to-drive s1 s0) 89)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 87)
	(= (time-to-drive s4 s0) 87)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 29)
	(= (time-to-drive s5 s0) 29)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 56)
	(= (time-to-drive s6 s0) 56)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 50)
	(= (time-to-drive s3 s1) 50)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 11)
	(= (time-to-drive s6 s1) 11)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 25)
	(= (time-to-drive s5 s2) 25)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 35)
	(= (time-to-drive s0 s3) 35)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 8)
	(= (time-to-drive s2 s3) 8)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 21)
	(= (time-to-drive s6 s3) 21)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 54)
	(= (time-to-drive s7 s3) 54)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 1)
	(= (time-to-drive s1 s4) 1)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 83)
	(= (time-to-drive s2 s4) 83)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 92)
	(= (time-to-drive s5 s4) 92)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 12)
	(= (time-to-drive s6 s5) 12)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 11)
	(= (time-to-drive s4 s6) 11)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 68)
	(= (time-to-drive s1 s7) 68)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 81)
	(= (time-to-drive s4 s7) 81)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 32)
	(= (time-to-drive s5 s7) 32)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s7)
	(at driver2 s4)
	(at driver3 s0)
	(at truck1 s2)
	(at truck4 s7)
	(at package1 s1)
	(at package2 s4)
	(at package3 s1)
	(at package4 s7)
	(at package5 s7)
	(at package6 s2)
	(at package7 s6)
	(at package8 s5)
	(at package9 s6)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 14
2. (drive-truck truck1 s4 s7 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (driven) from 0 to 81
   goals met: 3 of 14
3. (walk driver4 s3 p2-3)
   deleted: (at driver4 s3)
   added: (at driver4 p2-3)
   changed: (walked) from 0 to 77
   goals met: 3 of 14
4. (walk driver4 p2-3 s2)
   deleted: (at driver4 p2-3)
   added: (at driver4 s2)
   changed: (walked) from 77 to 106
   goals met: 3 of 14
5. (load-truck package7 truck1 s7)
   deleted: (at package7 s7)
   added: (in package7 truck1)
   goals met: 3 of 14
6. (drive-truck truck1 s7 s4 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (driven) from 81 to 162
   goals met: 3 of 14
7. (load-truck package4 truck1 s4)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   goals met: 3 of 14
8. (drive-truck truck1 s4 s7 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (driven) from 162 to 243
   goals met: 3 of 14
9. (unload-truck package4 truck1 s7)
   deleted: (in package4 truck1)
   added: (at package4 s7)
   goals met: 4 of 14
10. (board-truck driver4 truck4 s2)
   deleted: (at driver4 s2) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 4 of 14
11. (drive-truck truck4 s2 s3 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   changed: (driven) from 243 to 251
   goals met: 4 of 14
12. (drive-truck truck1 s7 s4 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (driven) from 251 to 332
   goals met: 4 of 14
13. (load-truck package2 truck4 s3)
   deleted: (at package2 s3)
   added: (in package2 truck4)
   goals met: 4 of 14
14. (drive-truck truck4 s3 s7 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   changed: (driven) from 332 to 386
   goals met: 5 of 14
15. (drive-truck truck1 s4 s6 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (driven) from 386 to 397
   goals met: 5 of 14
16. (load-truck package6 truck1 s6)
   deleted: (at package6 s6)
   added: (in package6 truck1)
   goals met: 5 of 14
17. (unload-truck package7 truck1 s6)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   goals met: 6 of 14
18. (drive-truck truck1 s6 s4 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (driven) from 397 to 408
   goals met: 6 of 14
19. (drive-truck truck4 s7 s4 driver4)
   deleted: (at truck4 s7)
   added: (at truck4 s4)
   changed: (driven) from 408 to 489
   goals met: 5 of 14
20. (unload-truck package2 truck4 s4)
   deleted: (in package2 truck4)
   added: (at package2 s4)
   goals met: 6 of 14
21. (drive-truck truck4 s4 s7 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s7)
   changed: (driven) from 489 to 570
   goals met: 7 of 14
22. (drive-truck truck1 s4 s5 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 570 to 662
   goals met: 7 of 14
23. (disembark-truck driver1 truck1 s5)
   deleted: (driving driver1 truck1)
   added: (at driver1 s5) (empty truck1)
   goals met: 7 of 14
24. (walk driver1 s5 p7-5)
   deleted: (at driver1 s5)
   added: (at driver1 p7-5)
   changed: (walked) from 106 to 150
   goals met: 7 of 14
25. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 14
26. (walk driver1 p7-5 s7)
   deleted: (at driver1 p7-5)
   added: (at driver1 s7)
   changed: (walked) from 150 to 152
   goals met: 8 of 14
27. (load-truck package3 truck1 s5)
   deleted: (at package3 s5)
   added: (in package3 truck1)
   goals met: 8 of 14
28. (load-truck package9 truck1 s5)
   deleted: (at package9 s5)
   added: (in package9 truck1)
   goals met: 8 of 14
29. (drive-truck truck1 s5 s6 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (driven) from 662 to 674
   goals met: 8 of 14
30. (unload-truck package9 truck1 s6)
   deleted: (in package9 truck1)
   added: (at package9 s6)
   goals met: 9 of 14
31. (drive-truck truck1 s6 s4 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (driven) from 674 to 685
   goals met: 9 of 14
32. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 685 to 768
   goals met: 10 of 14
33. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 11 of 14
34. (drive-truck truck4 s7 s1 driver4)
   deleted: (at truck4 s7)
   added: (at truck4 s1)
   changed: (driven) from 768 to 836
   goals met: 10 of 14
35. (drive-truck truck1 s2 s4 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 836 to 919
   goals met: 9 of 14
36. (load-truck package5 truck4 s1)
   deleted: (at package5 s1)
   added: (in package5 truck4)
   goals met: 9 of 14
37. (drive-truck truck4 s1 s7 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s7)
   changed: (driven) from 919 to 987
   goals met: 10 of 14
38. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 987 to 988
   goals met: 10 of 14
39. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 11 of 14
40. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 988 to 1038
   goals met: 11 of 14
41. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 11 of 14
42. (unload-truck package5 truck4 s7)
   deleted: (in package5 truck4)
   added: (at package5 s7)
   goals met: 12 of 14
43. (disembark-truck driver4 truck4 s7)
   deleted: (driving driver4 truck4)
   added: (at driver4 s7) (empty truck4)
   goals met: 12 of 14
44. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   changed: (walked) from 152 to 229
   goals met: 12 of 14
45. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   changed: (walked) from 229 to 258
   goals met: 12 of 14
46. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   changed: (walked) from 258 to 328
   goals met: 12 of 14
47. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   changed: (walked) from 328 to 349
   goals met: 13 of 14
48. (walk driver3 s0 p0-3)
   deleted: (at driver3 s0)
   added: (at driver3 p0-3)
   changed: (walked) from 349 to 387
   goals met: 12 of 14
49. (walk driver3 p0-3 s3)
   deleted: (at driver3 p0-3)
   added: (at driver3 s3)
   changed: (walked) from 387 to 398
   goals met: 12 of 14
50. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 12 of 14
51. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 1038 to 1046
   goals met: 13 of 14
52. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 13 of 14
53. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   changed: (walked) from 398 to 460
   goals met: 13 of 14
54. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   changed: (walked) from 460 to 554
   goals met: 14 of 14
